app/controllers/posts_controller.rb

  def index
    if params[:author_id] #if there is an :author_id in the params hash, user navigated to authors/:id/posts
      @posts = Author.find(params[:author_id]).posts #user accessing index of a post by a certain author
    else
      @posts = Post.all #user accessing index of all posts. user navigated to /posts
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"